package ru.geekbrains.java3.lesson5.homework;

import java.io.FileNotFoundException;
import java.io.FileOutputStream;
import java.util.concurrent.ConcurrentSkipListMap;

public class MainClass {
// Домашнее задание:
// 1) Создать три потока, каждый из которых выводит определенную букву(A, B и C), порядок должен быть именно ABCABCABC...
// (просто создав потоки и запустив их, Вы не сможете это гарантировать), если не сможете сделать сами по примеру из исходников,
// просто разберите код из решения
// 2) Написать совсем небольшой метод, в котором несколько потоков построчно пишут данные в файл(штук по 20 записей, с периодом в 50 мс)
// 3) Написать класс МФУ на котором возможны одновременная печать и сканирование документов, при этом нельзя
// одновременно печатать два документа или сканировать(при печати в консоль выводится сообщения "отпечатано 1, 2, 3,... страницы",
// при сканировании то же самое только "отсканировано...", вывод в консоль все также с периодом в 50 мс.)
    public static void main(String[] args) {

    }
}
