package ru.geekbrains.java3.dz.dz6.eugene_shamkin;

/**
 * Написать метод, которому в качестве аргумента передается не пустой одномерный
 * целочисленный массив, метод должен вернуть новый массив, который получен путем
 * вытаскивания элементов из исходного массива, идущих после последней четверки.
 * Входной массив должен содержать хотя бы одну четверку, в противном случае в методе
 * необходимо выбросить RuntimeException. Написать набор тестов для этого метода
 * (варианта 3-4 входных данных) вх: [ 1 2 4 4 2 3 4 1 7 ] -> вых: [ 1 7 ]
 */
public class Task1 {
    
}
